In [10]:
import os

import pandas as pd

from pydataset import data

import env

import seaborn as sns

# import our own acquire module
import acquire

import numpy as np

import matplotlib.pyplot as plt


# import splitting and imputing functions
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

# turn off pink boxes for demo
import warnings
warnings.filterwarnings("ignore")

**# 4 Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.**

    print the first 3 rows
    print the number of rows and columns (shape)
    print the column names
    print the data type of each column
    print the summary statistics for each of the numeric variables

In [43]:
df_iris_sns = sns.load_dataset('iris')

In [118]:
# importing from acquire.py

iri = acquire.get_iris_data(env.sql_connexion)

In [3]:
iris_df = data('iris')

iris_df.info()

# importing directly from pydataset

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [119]:
iri.isna().sum()

# checking for NaN values, tabulated by sum

species_id        0
species_name      0
measurement_id    0
sepal_length      0
sepal_width       0
petal_length      0
petal_width       0
dtype: int64

In [4]:
iris_df.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [5]:
df_iris_sns.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [6]:
iris_df.shape

(150, 5)

In [7]:
iris_df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [8]:
iris_df.columns.to_list()

# prints only column names

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [9]:
iris_df.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [10]:
iris_df.describe().T

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

## SCROLL DOWN FOR Nº 5

**# 6 Download the previous exercise's file into an excel (File → Download → Microsoft Excel).**  
**Read the downloaded file into a dataframe named df_excel.**

    assign the first 100 rows to a new dataframe, df_excel_sample
    print the number of rows of your original dataframe
    print the first 5 column names
    print the column names that have a data type of 'object'
    compute the range for each of the numeric variables.

In [11]:
df_excel = pd.read_excel('train.xlsx', sheet_name = 'train')

# similar : df_excel = pd.read_excel('train.xlsx')

In [12]:
df_excel_sample = df_excel.head(100)

# assigns the first 100 rows to a new dataframe, df_excel_sample

In [13]:
df_excel_sample.shape

(100, 12)

In [14]:
df_excel.shape[0]

# prints the number of rows of your original dataframe

891

In [15]:
len(df_excel.index)

# prints the number of rows of your original dataframe

891

In [16]:

print(df_excel.columns[5:])

# gives the columns starting at index 5 to the end.

Index(['Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')

In [17]:
# prints the names of the first 5 columns
print(df_excel.columns[:5])

# prints the 1st index, aka, the number of columns
print(df_excel.shape[1])

df_excel.iloc[: , :5]

# prints the first 5 column names

# alternate way to print the first 5 columns : 
    # df_excel[df_excel.columns[:5]]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')
12

,PassengerId,Survived,Pclass,Name,Sex
0,1,0,3,"Braund, Mr. Owen Harris",male
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female
2,3,1,3,"Heikkinen, Miss. Laina",female
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female
4,5,0,3,"Allen, Mr. William Henry",male
...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male
887,888,1,1,"Graham, Miss. Margaret Edith",female
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female
889,890,1,1,"Behr, Mr. Karl Howell",male
890,891,0,3,"Dooley, Mr. Patrick",male

In [18]:
df_excel.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [19]:
print(df_excel.select_dtypes(include = ['object']).columns)

print(list(df_excel.select_dtypes(include=['object']).columns))

# prints the column names that have a data type of 'object'

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')
['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [20]:
# find the columns with numeric variables
# excludes the objects

print(df_excel.select_dtypes(exclude = ['object']).columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [21]:
#  compute the range for each of the numeric variables :
# find the columns with numeric variables

(list(df_excel.select_dtypes(include=['int64', 'float64']).columns))

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [22]:
# df_excel.sort_values

# df_excel['PassengerId'](df_excel.max() - df_excel.min()).idxmax()

pIDrange = df_excel['PassengerId'].max() - df_excel['PassengerId'].min()
pIDrange

#  computes the range for each of the numeric variables.

890

In [23]:
survivedrange = df_excel['Survived'].max() - df_excel['Survived'].min()
survivedrange

1

In [24]:
survivedrangecombo = df_excel[['Survived', 'Pclass']].max() - df_excel[['Survived', 'Pclass']].min()
survivedrangecombo

Survived    1
Pclass      2
dtype: int64

In [44]:
titanic_stats = df_excel[['Age', 'Fare']].describe().T
titanic_stats

      count       mean        std   min      25%      50%   75%       max
Age   714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
Fare  891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [45]:
titanic_stats['range'] = titanic_stats['max'] - titanic_stats['min']
titanic_stats['range']

Age      79.5800
Fare    512.3292
Name: range, dtype: float64

In [ ]:
passclass = df_excel['Pclass'].max() - df_excel['Pclass'].min()
passclass

In [ ]:
p_age = df_excel['Age'].max() - df_excel['Age'].min()
p_age

In [ ]:
SibSprange = df_excel['SibSp'].max() - df_excel['SibSp'].min()
SibSprange

In [ ]:
Parch_range = df_excel['Parch'].max() - df_excel['Parch'].min()
Parch_range

In [ ]:
Fare_range = df_excel['Fare'].max() - df_excel['Fare'].min()
Fare_range

**# 5 Read the data from this google sheet into a dataframe, df_google.**

    print the first 3 rows
    print the number of rows and columns
    print the column names
    print the data type of each column
    print the summary statistics for each of the numeric variables
    print the unique values for each of your categorical variables

In [ ]:

# grab the google sheet
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

# this code in is applied to all url replacements



df_googlesheet = pd.read_csv(csv_export_url)

In [ ]:
df_googlesheet.head(3)

In [ ]:
df_googlesheet.shape

In [ ]:
df_googlesheet.columns

In [ ]:
df_googlesheet.dtypes

In [ ]:
df_googlesheet.describe()

In [ ]:
df_googlesheet.nunique()

In [ ]:
df_googlesheet.Survived.value_counts(dropna = False)

In [ ]:
df_googlesheet.Sex.value_counts(dropna = False)

In [ ]:
df_googlesheet.Embarked.value_counts(dropna = False)

## <p style="background-color:Violet;">  Data Preparation Exercises

**<p style="background-color:yellow;"> Nº1 / Using the Iris Data :**

    Use the function defined in acquire.py to load the iris data.

    Drop the species_id and measurement_id columns.

    Rename the species_name column to just species.

    Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

    Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [44]:
iris_data = acquire.get_iris_data(env.sql_connexion)

In [49]:
iris_data.shape

(150, 7)

In [50]:
# Drop the species_id and measurement_id columns.

iris_data.columns.to_list()

['species_id',
 'species_name',
 'measurement_id',
 'sepal_length',
 'sepal_width',
 'petal_length',
 'petal_width']

In [51]:
# Drop the species_id and measurement_id columns.

i_drop = ['species_id', 'measurement_id']

iris_data.drop(columns = i_drop, inplace = True)

In [121]:
## alternate drop method

iri = iri.drop(columns = ['species_id', 'measurement_id'])

# no 'inplace = True', instead assigning it to the variable name.
# potentially allows for greater future flexibility

In [52]:
iris_data.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

In [53]:
#     Rename the species_name column to just species.

iris_data = iris_data.rename(columns = {"species_name": "species"})

#   Could also do 'inplace = True', but without reassigning it to the variable

In [54]:
#  Create dummy variables of the species name and concatenate onto the iris dataframe. 
# (This is for practice, we don't always have to encode the target, but if we used 
# species as a feature, we would need to encode it).

dummy_iris = pd.get_dummies(iris_data[['species']])

dummy_iris.head()

# encoding the species

   species_setosa  species_versicolor  species_virginica
0               1                   0                  0
1               1                   0                  0
2               1                   0                  0
3               1                   0                  0
4               1                   0                  0

In [124]:
pd.get_dummies(iri.species_name, drop_first = True).head()

# alternate to the above cell.

   versicolor  virginica
0           0          0
1           0          0
2           0          0
3           0          0
4           0          0

In [55]:
drop_1st_iris = pd.get_dummies(iris_data[['species']],  drop_first = True)

# concatenate onto the iris dataframe. 

concat_dummy_iris = pd.concat([iris_data, dummy_iris], axis = 1)

# attaches the tables row-wise, a 0-axis concatenation


concat_dummy_iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

In [56]:
##    Create a function named prep_iris that accepts the untransformed iris data, 
##    and returns the data with the transformations above applied.

def prep_iris(df):
    '''
    prep_iris will take in the version of the iris dataset based on what 
    is stated in acquire.py, and make appropriate cleaning changes.
    
    positional arguments : 'df', an uncleaned version of the iris dataset.
    returns: 'concat_dummy_iris' (or whatever the assignedvariable name is),
      a cleaned version of the iris dataframe
    '''
    
    i_drop = ['species_id', 'measurement_id']

    df.drop(columns = i_drop, axis = 1, inplace = True)
    
    df = df.rename(columns={"species_name": "species"})

    dummy_iris = pd.get_dummies(df[['species']])
    
    concat_dummy_iris = pd.concat([df, dummy_iris], axis = 1)
    
    return concat_dummy_iris

In [57]:
test_iris_df = acquire.get_iris_data(env.sql_connexion)

test_iris_df.head()

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2

In [47]:
tidied_iris = prep_iris(test_iris_df)

tidied_iris

,species,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0
5,setosa,5.4,3.9,1.7,0.4,1,0,0
6,setosa,4.6,3.4,1.4,0.3,1,0,0
7,setosa,5.0,3.4,1.5,0.2,1,0,0
8,setosa,4.4,2.9,1.4,0.2,1,0,0
9,setosa,4.9,3.1,1.5,0.1,1,0,0
10,setosa,5.4,3.7,1.5,0.2,1,0,0
11,setosa,4.8,3.4,1.6,0.2,1,0,0
12,setosa,4.8,3.0,1.4,0.1,1,0,0
13,setosa,4.3,3.0,1.1,0.1,1,0,0
14,setosa,5.8,4.0,1.2,0.2,1,0,0
15,setosa,5.7,4.4,1.5,0.4,1,0,0
16,setosa,5.4,3.9,1.3,0.4,1,0,0
17,setosa,5.1,3.5,1.4,0.3,1,0,0
18,setosa,5.7,3.8,1.7,0.3,1,0,0
19,setosa,5.1,3.8,1.5,0.3,1,0,0
20,setosa,5.4,3.4,1.7,0.2,1,0,0
21,setosa,5.1,3.7,1.5,0.4,1,0,0
22,setosa,4.6,3.6,1.0,0.2,1,0,0
23,setosa,5.1,3.3,1.7,0.5,1,0,0
24,setosa,4.8,3.4,1.9,0.2,1,0,0
25,setosa,5.0,3.0,1.6,0.2,1,0,0
26,setosa,5.0,3.4,1.6,0.4,1,0,0
27,setosa,5.2,3.5,1.5,0.2,1,0,0
28,setosa,5.2,3.4,1.4,0.2,1,0,0
29,setosa,4.7,3.2,1.6,0.2,1,0,0
30,setosa,4.8,3.1,1.6,0.2,1,0,0
31,setosa,5.4,3.4,1.5,0.4,1,0,0
32,setosa,5.2,4.1,1.5,0.1,1,0,0
33,setosa,5.5,4.2,1.4,0.2,1,0,0
34,setosa,4.9,3.1,1.5,0.2,1,0,0
35,setosa,5.0,3.2,1.2,0.2,1,0,0
36,setosa,5.5,3.5,1.3,0.2,1,0,0
37,setosa,4.9,3.6,1.4,0.1,1,0,0
38,setosa,4.4,3.0,1.3,0.2,1,0,0
39,setosa,5.1,3.4,1.5,0.2,1,0,0
40,setosa,5.0,3.5,1.3,0.3,1,0,0
41,setosa,4.5,2.3,1.3,0.3,1,0,0
42,setosa,4.4,3.2,1.3,0.2,1,0,0
43,setosa,5.0,3.5,1.6,0.6,1,0,0
44,setosa,5.1,3.8,1.9,0.4,1,0,0
45,setosa,4.8,3.0,1.4,0.3,1,0,0
46,setosa,5.1,3.8,1.6,0.2,1,0,0
47,setosa,4.6,3.2,1.4,0.2,1,0,0
48,setosa,5.3,3.7,1.5,0.2,1,0,0
49,setosa,5.0,3.3,1.4,0.2,1,0,0
50,versicolor,7.0,3.2,4.7,1.4,0,1,0
51,versicolor,6.4,3.2,4.5,1.5,0,1,0
52,versicolor,6.9,3.1,4.9,1.5,0,1,0
53,versicolor,5.5,2.3,4.0,1.3,0,1,0
54,versicolor,6.5,2.8,4.6,1.5,0,1,0
55,versicolor,5.7,2.8,4.5,1.3,0,1,0
56,versicolor,6.3,3.3,4.7,1.6,0,1,0
57,versicolor,4.9,2.4,3.3,1.0,0,1,0
58,versicolor,6.6,2.9,4.6,1.3,0,1,0
59,versicolor,5.2,2.7,3.9,1.4,0,1,0
60,versicolor,5.0,2.0,3.5,1.0,0,1,0
61,versicolor,5.9,3.0,4.2,1.5,0,1,0
62,versicolor,6.0,2.2,4.0,1.0,0,1,0
63,versicolor,6.1,2.9,4.7,1.4,0,1,0
64,versicolor,5.6,2.9,3.6,1.3,0,1,0
65,versicolor,6.7,3.1,4.4,1.4,0,1,0
66,versicolor,5.6,3.0,4.5,1.5,0,1,0
67,versicolor,5.8,2.7,4.1,1.0,0,1,0
68,versicolor,6.2,2.2,4.5,1.5,0,1,0
69,versicolor,5.6,2.5,3.9,1.1,0,1,0
70,versicolor,5.9,3.2,4.8,1.8,0,1,0
71,versicolor,6.1,2.8,4.0,1.3,0,1,0
72,versicolor,6.3,2.5,4.9,1.5,0,1,0
73,versicolor,6.1,2.8,4.7,1.2,0,1,0
74,versicolor,6.4,2.9,4.3,1.3,0,1,0
75,versicolor,6.6,3.0,4.4,1.4,0,1,0
76,versicolor,6.8,2.8,4.8,1.4,0,1,0
77,versicolor,6.7,3.0,5.0,1.7,0,1,0
78,versicolor,6.0,2.9,4.5,1.5,0,1,0
79,versicolor,5.7,2.6,3.5,1.0,0,1,0
80,versicolor,5.5,2.4,3.8,1.1,0,1,0
81,versicolor,5.5,2.4,3.7,1.0,0,1,0
82,versicolor,5.8,2.7,3.9,1.2,0,1,0
83,versicolor,6.0,2.7,5.1,1.6,0,1,0
84,versicolor,5.4,3.0,4.5,1.5,0,1,0
85,versicolor,6.0,3.4,4.5,1.6,0,1,0
86,versicolor,6.7,3.1,4.7,1.5,0,1,0
87,versicolor,6.3,2.3,4.4,1.3,0,1,0
88,versicolor,5.6,3.0,4.1,1.3,0,1,0
89,versicolor,5.5,2.5,4.0,1.3,0,1,0
90,versicolor,5.5,2.6,4.4,1.2,0,1,0
91,versicolor,6.1,3.0,4.6,1.4,0,1,0
92,versicolor,5.8,2.6,4.0,1.2,0,1,0
93,versicolor,5.0,2.3,3.3,1.0,0,1,0
94,versicolor,5.6,2.7,4.2,1.3,0,1,0
95,versicolor,5.7,3.0,4.2,1.2,0,1,0
96,versicolor,5.7,2.9,4.2,1.3,0,1,0
97,versicolor,6.2,2.9,4.3,1.3,0,1,0
98,versicolor,5.1,2.5,3.0,1.1,0,1,0
99,versicolor,5.7,2.8,4.1,1.3,0,1,0
100,virginica,6.3,3.3,6.0,2.5,0,0,1
101,virginica,5.8,2.7,5.1,1.9,0,0,1
102,virginica,7.1,3.0,5.9,2.1,0,0,1
103,virginica,6.3,2.9,5.6,1.8,0,0,1
104,virginica,6.5,3.0,5.8,2.2,0,0,1
105,virginica,7.6,3.0,6.6,2.1,0,0,1
106,virginica,4.9,2.5,4.5,1.7,0,0,1
107,virginica,7.3,2.9,6.3,1.8,0,0,1
108,virginica,6.7,2.5,5.8,1.8,0,0,1
109,virginica,7.2,3.6,6.1,2.5,0,0,1
110,virginica,6.5,3.2,5.1,2.0,0,0,1
111,virginica,6.4,2.7,5.3,1.9,0,0,1
112,virginica,6.8,3.0,5.5,2.1,0,0,1
113,virginica,5.7,2.5,5.0,2.0,0,0,1
114,virginica,5.8,2.8,5.1,2.4,0,0,1
115,virginica,6.4,3.2,5.3,2.3,0,0,1
116,virginica,6.5,3.0,5.5,1.8,0,0,1
117,virginica,7.7,3.8,6.7,2.2,0,0,1
118,virginica,7.7,2.6,6.9,2.3,0,0,1
119,virginica,6.0,2.2,5.0,1.5,0,0,1
120,virginica,6.9,3.2,5.7,2.3,0,0,1
121,virginica,5.6,2.8,4.9,2.0,0,0,1
122,virginica,7.7,2.8,6.7,2.0,0,0,1
123,virginica,6.3,2.7,4.9,1.8,0,0,1
124,virginica,6.7,3.3,5.7,2.1,0,0,1
125,virginica,7.2,3.2,6.0,1.8,0,0,1
126,virginica,6.2,2.8,4.8,1.8,0,0,1
127,virginica,6.1,3.0,4.9,1.8,0,0,1
128,virginica,6.4,2.8,5.6,2.1,0,0,1
129,virginica,7.2,3.0,5.8,1.6,0,0,1
130,virginica,7.4,2.8,6.1,1.9,0,0,1
131,virginica,7.9,3.8,6.4,2.0,0,0,1
132,virginica,6.4,2.8,5.6,2.2,0,0,1
133,virginica,6.3,2.8,5.1,1.5,0,0,1
134,virginica,6.1,2.6,5.6,1.4,0,0,1
135,virginica,7.7,3.0,6.1,2.3,0,0,1
136,virginica,6.3,3.4,5.6,2.4,0,0,1
137,virginica,6.4,3.1,5.5,1.8,0,0,1
138,virginica,6.0,3.0,4.8,1.8,0,0,1
139,virginica,6.9,3.1,5.4,2.1,0,0,1
140,virginica,6.7,3.1,5.6,2.4,0,0,1
141,virginica,6.9,3.1,5.1,2.3,0,0,1
142,virginica,5.8,2.7,5.1,1.9,0,0,1
143,virginica,6.8,3.2,5.9,2.3,0,0,1
144,virginica,6.7,3.3,5.7,2.5,0,0,1
145,virginica,6.7,3.0,5.2,2.3,0,0,1
146,virginica,6.3,2.5,5.0,1.9,0,0,1
147,virginica,6.5,3.0,5.2,2.0,0,0,1
148,virginica,6.2,3.4,5.4,2.3,0,0,1
149,virginica,5.9,3.0,5.1,1.8,0,0,1

In [ ]:
# alternate to the above two cells:
    
class_format = prep_iris(acquire.get_iris_data(env.sql_connexion))

**<p style="background-color:yellow;"> Nº2 / Using the Titanic dataset :**

    Use the function defined in acquire.py to load the Titanic data.

    Drop any unnecessary, unhelpful, or duplicated columns.

    Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

    Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [ ]:
## the words titanic and iris are irrelevant, note the index column on cached a csv when 
## either saving or loading pandas dataframe into a csv

In [139]:
titanic_data = acquire.get_titanic_data(env.sql_connexion)

titanic_data.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [140]:
# Drop any unnecessary, unhelpful, or duplicated columns.

t_drop = ['passenger_id', 'embarked', 'class','deck', 'age']

titanic_data.drop(columns = t_drop, inplace = True)

In [143]:
titanic_data = titanic_data.drop(['Unnamed: 0'], axis=1)

In [141]:
# Encode the categorical columns. Create dummy variables of the categorical 
# columns and concatenate them onto the dataframe.

titanic_data.isna().sum()

Unnamed: 0     0
survived       0
pclass         0
sex            0
sibsp          0
parch          0
fare           0
embark_town    2
alone          0
dtype: int64

In [ ]:
## atlernate ways to encode (create dummies)

# titanic.sex.map({'female':1, 'male':0})

# np.where(titanic['sex'] == 'female', 1, 0)

In [144]:
# Create dummy variables of the categorical columns

t_dummy = pd.get_dummies(titanic_data[['sex', 'embark_town']], drop_first = True)
t_dummy.head()

   sex_male  embark_town_Queenstown  embark_town_Southampton
0         1                       0                        1
1         0                       0                        0
2         0                       0                        1
3         0                       0                        1
4         1                       0                        1

In [ ]:
# concatenate them onto the dataframe

In [150]:
t_concat = pd.concat([titanic_data, t_dummy], axis = 1)
t_concat.head()

,survived,pclass,sex,sibsp,parch,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,1,0,7.2500,Southampton,0,1,0,1
1,1,1,female,1,0,71.2833,Cherbourg,0,0,0,0
2,1,3,female,0,0,7.9250,Southampton,1,0,0,1
3,1,1,female,1,0,53.1000,Southampton,0,0,0,1
4,0,3,male,0,0,8.0500,Southampton,1,1,0,1

In [153]:
titanic_data.dropna()

# drops NaN rows in embark_town and any other row with a null value

     survived  pclass     sex  sibsp  parch     fare  embark_town  alone
0           0       3    male      1      0   7.2500  Southampton      0
1           1       1  female      1      0  71.2833    Cherbourg      0
2           1       3  female      0      0   7.9250  Southampton      1
3           1       1  female      1      0  53.1000  Southampton      0
4           0       3    male      0      0   8.0500  Southampton      1
..        ...     ...     ...    ...    ...      ...          ...    ...
886         0       2    male      0      0  13.0000  Southampton      1
887         1       1  female      0      0  30.0000  Southampton      1
888         0       3  female      1      2  23.4500  Southampton      0
889         1       1    male      0      0  30.0000    Cherbourg      1
890         0       3    male      0      0   7.7500   Queenstown      1

[889 rows x 8 columns]

In [154]:
## Create a function named prep_titanic that accepts the raw 
# titanic data, and returns the data with the transformations above applied.

def prep_titanic(df):
    t_drop = ['passenger_id', 'embarked', 'deck', 'age']

    df.drop(columns = t_drop, inplace = True)
    
    df = df.drop(['Unnamed: 0'], axis=1)
    
    titanic_data.dropna()
    
    t_dummy = pd.get_dummies(df[['sex', 'embark_town']], drop_first = True)

    t_concat = pd.concat([df, t_dummy], axis = 1)
    
    return t_concat

In [157]:
test_titanic_df = acquire.get_titanic_data(env.sql_connexion)

test_titanic_df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [158]:
tidied_titanic = prep_titanic(test_titanic_df)

tidied_titanic

,survived,pclass,sex,sibsp,parch,fare,class,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,1,0,7.2500,Third,Southampton,0,1,0,1
1,1,1,female,1,0,71.2833,First,Cherbourg,0,0,0,0
2,1,3,female,0,0,7.9250,Third,Southampton,1,0,0,1
3,1,1,female,1,0,53.1000,First,Southampton,0,0,0,1
4,0,3,male,0,0,8.0500,Third,Southampton,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,0,0,13.0000,Second,Southampton,1,1,0,1
887,1,1,female,0,0,30.0000,First,Southampton,1,0,0,1
888,0,3,female,1,2,23.4500,Third,Southampton,0,0,0,1
889,1,1,male,0,0,30.0000,First,Cherbourg,1,1,0,0
890,0,3,male,0,0,7.7500,Third,Queenstown,1,1,1,0

**<p style="background-color:yellow;"> Nº3 / Using the Telco dataset**

    Use the function defined in acquire.py to load the Telco data.

    Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

    Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

    Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

In [178]:
#  Use the function defined in acquire.py to load the Telco data.

telco_data = acquire.get_telco_data(env.sql_connexion)

telco_data.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [173]:
telco_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 24 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   payment_type_id           7043 non-null   int64
 1   internet_service_type_id  7043 non-null   int64
 2   contract_type_id          7043 non-null   int64
 3   customer_id               7043 non-null   object
 4   gender                    7043 non-null   object
 5   senior_citizen            7043 non-null   int64
 6   partner                   7043 non-null   object
 7   dependents                7043 non-null   object
 8   tenure                    7043 non-null   int64
 9   phone_service             7043 non-null   object
 10  multiple_lines            7043 non-null   object
 11  online_security           7043 non-null   object
 12  online_backup             7043 non-null   object
 13  device_protection         7043 non-null   object
 14  tech_support              7043 non-null   object
 15  streaming_tv              7043 non-null   object
 16  streaming_movies          7043 non-null   object
 17  paperless_billing         7043 non-null   object
 18  monthly_charges           7043 non-null   float64
 19  total_charges             7043 non-null   object
 20  churn                     7043 non-null   object
 21  contract_type             7043 non-null   object
 22  internet_service_type     7043 non-null   object
 23  payment_type              7043 non-null   object
dtypes: float64(1), int64(5), object(18)
memory usage: 1.3+ MB

In [179]:
### IN-CLASS

## use crosstabs to check values

telco_data[['payment_type_id', 'payment_type']]

pd.crosstab(telco_data.payment_type_id, telco_data.payment_type)

payment_type,Bank transfer (automatic),Credit card (automatic),Electronic check,Mailed check
payment_type_id,,,,
1,0,0,2365,0
2,0,0,0,1612
3,1544,0,0,0
4,0,1522,0,0

In [164]:
### IN-CLASS

pd.crosstab(telco_data.payment_type_id, telco_data.payment_type)

## we know that... something.

payment_type,Bank transfer (automatic),Credit card (automatic),Electronic check,Mailed check
payment_type_id,,,,
1,0,0,2365,0
2,0,0,0,1612
3,1544,0,0,0
4,0,1522,0,0

In [169]:
# i can't convert an empty string into a float, but I can concatenate a 0 as 
# a string to the end of it
float('' + '0')

0.0

In [180]:
t### IN-CLASS

elco_data.total_charges.value_counts()

## 11 nulls = no payments (yet), so we need to impute a 0

           11
20.2       11
19.75       9
19.9        8
20.05       8
           ..
2387.75     1
6302.8      1
2058.5      1
829.55      1
3707.6      1
Name: total_charges, Length: 6531, dtype: int64

In [183]:
### IN-CLASS

## change datatype of inappropriately classed data (here, total_charges is an object)

# telco_data.total_charges.astype('float') gives an error msg. See above.

(telco_data.total_charges + '0').astype('float')

0        593.30
1        542.40
2        280.85
3       1237.85
4        267.40
         ...
7038     742.90
7039    1873.70
7040      92.75
7041    4627.65
7042    3707.60
Name: total_charges, Length: 7043, dtype: float64

In [195]:
### IN-CLASStelco_data.total_charges.dtype == 'object'

In [190]:
### IN-CLASS

telco_data.churn.value_counts()

No     5174
Yes    1869
Name: churn, dtype: int64

In [188]:
### IN-CLASS

telco_data['tech_support'].value_counts().size

# checking to see if it's a binary category. It's not (3 values)
# this gives us anidea of if we want to one-hot encode (dummies)

3

In [1]:
### IN-CLASS

## CONSTRUCT A LOOP to see if the dtype associated with the series in telco_data is an object (str)
## then we will append it to our categorical lsit of columnnames, otherwise it will be assumed to be numerical

categorical_columns = []
bin_cats = []
mult_cats = []
numerical_columns = []

for col in telco_data.columns:
    if telco_data[col].dtype == 'object':
        categorical_columns.append(col)
        if telco_data[col].value_counts().size > 2:
            mult_cats.append()

NameError: name 'telco_data' is not defined

In [192]:
### IN-CLASS

bin_cats

[]

In [194]:
### IN-CLASS

mult_cats

[]

In [ ]:
### IN-CLASS

mult_cats.remove('customer_id')

# .remove() on a list method will change the underlying data without reassigment

In [ ]:
### IN-CLASS
## this tels us what the categories are of each column, for .map

telco_data['paperless_billing'].value_counts()

In [ ]:
### IN-CLASS

## encode all of the binary columns
## this is one of several options. Here, .map is used

telco_data['paperless_billing'] = telco_data['paperless_billing'].map({'No':0, 'Yes':1})

In [ ]:
### IN-CLASS

## pass all other non-binary categoricals into dummy columns

telco = pd.concat([
    telco_data,
    pd.get_dummies(telco_data[mult_cats])
], axis = 1)

In [ ]:
##   Drop any unnecessary, unhelpful, or duplicated columns. 

##  ___ --> drop outall of the ids that appear in my dataset in this duplicate-info manner : 
## payment_type_id, internet_service_type_id 	contract_type_id 	

columns_drop = ['payment_type_id', 'internet_service_type_id','contract_type_id']

In [4]:
##     Encode the categorical columns. 
#      Create dummy variables of the categorical columns and concatenate them onto the dataframe.

tel_dummy = pd.get_dummies(telco_data[['gender','partner', 'dependents', 'paperless_billing']])
tel_dummy.head()

,gender_Female,gender_Male,partner_No,partner_Yes,dependents_No,dependents_Yes,paperless_billing_No,paperless_billing_Yes
0,1,0,0,1,0,1,0,1
1,0,1,1,0,1,0,1,0
2,0,1,1,0,1,0,0,1
3,0,1,0,1,1,0,0,1
4,1,0,0,1,1,0,0,1

In [6]:
tel_concat = pd.concat([telco_data, tel_dummy], axis = 1)

In [7]:
##    Create a function named prep_telco that accepts the raw telco data, 
#     and returns the data with the transformations above applied.

def prep_telco(df):
    
    tel_dummy = pd.get_dummies(df[['gender','partner', 'dependents', 'paperless_billing']])
    
    tel_concat = pd.concat([df, tel_dummy], axis = 1)
    
    return tel_concat

In [8]:
test_telco_df = acquire.get_telco_data(env.sql_connexion)

test_telco_df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [9]:
tidied_telco = prep_telco(test_telco_df)

tidied_telco

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,internet_service_type,payment_type,gender_Female,gender_Male,partner_No,partner_Yes,dependents_No,dependents_Yes,paperless_billing_No,paperless_billing_Yes
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,DSL,Mailed check,1,0,0,1,0,1,0,1
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,DSL,Mailed check,0,1,1,0,1,0,1,0
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,Fiber optic,Electronic check,0,1,1,0,1,0,0,1
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,Fiber optic,Electronic check,0,1,0,1,1,0,0,1
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Fiber optic,Mailed check,1,0,0,1,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,2,1,2,9987-LUTYD,Female,0,No,No,13,Yes,...,DSL,Mailed check,1,0,1,0,1,0,1,0
7039,1,2,1,9992-RRAMN,Male,0,Yes,No,22,Yes,...,Fiber optic,Electronic check,0,1,0,1,1,0,0,1
7040,2,1,1,9992-UJOEL,Male,0,No,No,2,Yes,...,DSL,Mailed check,0,1,1,0,1,0,0,1
7041,2,1,3,9993-LHIEB,Male,0,Yes,Yes,67,Yes,...,DSL,Mailed check,0,1,0,1,0,1,1,0
7042,1,1,3,9995-HOTOH,Male,0,Yes,Yes,63,No,...,DSL,Electronic check,0,1,0,1,0,1,1,0

**Nº4 Split your data**

    Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

    Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

    Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

    Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

In [109]:
## Write a function to split your data into train, test and validate datasets. 
#  Add this function to prepare.py.

## TITANIC DATA

seed = 27

train_titanic, val_test = train_test_split(tidied_titanic, train_size = 0.7, random_state = seed, stratify = tidied_titanic['alone'])

# TRAIN

In [110]:
## TITANIC DATA

print(train_titanic)
print('.-.-.-.-.-.---....----...-.-.-.-.-')

     survived  pclass     sex  sibsp  parch      fare   class  embark_town  \
228         0       2    male      0      0   13.0000  Second  Southampton
349         0       3    male      0      0    8.6625   Third  Southampton
602         0       1    male      0      0   42.4000   First  Southampton
581         1       1  female      1      1  110.8833   First    Cherbourg
463         0       2    male      0      0   13.0000  Second  Southampton
..        ...     ...     ...    ...    ...       ...     ...          ...
194         1       1  female      0      0   27.7208   First    Cherbourg
784         0       3    male      0      0    7.0500   Third  Southampton
551         0       2    male      0      0   26.0000  Second  Southampton
588         0       3    male      0      0    8.0500   Third  Southampton
808         0       2    male      0      0   13.0000  Second  Southampton

     alone  survived  alone  sex_male  embark_town_Queenstown  \
228      1         0      1         1                       0
349      1         0      1         1                       0
602      1         0      1         1                       0
581      0         1      0         0                       0
463      1         0      1         1                       0
..     ...       ...    ...       ...                     ...
194      1         1      1         0                       0
784      1         0      1         1                       0
551      1         0      1         1                       0
588      1         0      1         1                       0
808      1         0      1         1                       0

     embark_town_Southampton  class_Second  class_Third
228                        1             1            0
349                        1             0            1
602                        1             0            0
581                        0             0            0
463                        1             1            0
..                       ...           ...          ...
194                        0             0            0
784                        1             0            1
551                        1             1            0
588                        1             0            1
808                        1             1            0

[623 rows x 16 columns]
.-.-.-.-.-.---....----...-.-.-.-.-

In [40]:
## TITANIC DATA

print('.-.-.-.-.-.---....----...-.-.-.-.-')
print(val_test)

.-.-.-.-.-.---....----...-.-.-.-.-
     survived  pclass     sex  sibsp  parch      fare   class  embark_town  \
200         0       3    male      0      0    9.5000   Third  Southampton
845         0       3    male      0      0    7.5500   Third  Southampton
250         0       3    male      0      0    7.2500   Third  Southampton
626         0       2    male      0      0   12.3500  Second   Queenstown
4           0       3    male      0      0    8.0500   Third  Southampton
..        ...     ...     ...    ...    ...       ...     ...          ...
435         1       1  female      1      2  120.0000   First  Southampton
538         0       3    male      0      0   14.5000   Third  Southampton
41          0       2  female      1      0   21.0000  Second  Southampton
535         1       2  female      0      2   26.2500  Second  Southampton
625         0       1    male      0      0   32.3208   First  Southampton

     alone  survived  alone  sex_male  embark_town_Queenstown  \
200      1         0      1         1                       0
845      1         0      1         1                       0
250      1         0      1         1                       0
626      1         0      1         1                       1
4        1         0      1         1                       0
..     ...       ...    ...       ...                     ...
435      0         1      0         0                       0
538      1         0      1         1                       0
41       0         0      0         0                       0
535      0         1      0         0                       0
625      1         0      1         1                       0

     embark_town_Southampton  class_Second  class_Third
200                        1             0            1
845                        1             0            1
250                        1             0            1
626                        0             1            0
4                          1             0            1
..                       ...           ...          ...
435                        1             0            0
538                        1             0            1
41                         1             1            0
535                        1             1            0
625                        1             0            0

[268 rows x 16 columns]

In [107]:
## TITANIC DATA

train_titanic.shape, val_test.shape

((623, 16), (2113, 32))

In [111]:
## TITANIC DATA

validate_titanic, test_titanic = train_test_split(val_test, train_size = 0.5, random_state = seed, stratify = val_test['alone'])

# splitting validate
# gives us 3 sets of data

In [112]:
train_titanic.shape, validate_titanic.shape, test_titanic.shape

((623, 16), (134, 16), (134, 16))

In [206]:
## TITANIC DATA

# make a function
# returns 3 dataframes

def titanic_training_validate_testing(df, target = ''):
    
    seed = 27
    
    train_titanic, val_test = train_test_split(df, 
                                               train_size = 0.7, 
                                               random_state = seed, 
                                               stratify = df[target])

    validate_titanic, test_titanic = train_test_split(df, 
                                                      train_size = 0.5, 
                                                      random_state = seed, 
                                                      stratify = df[target])

    return train_titanic, validate_titanic, test_titanic

In [207]:
## Run the function on the Titanic dataset, 
## returning 3 datasets, train_titanic, validate_titanic and test_titanic. 

train_titanic, validate_titanic, test_titanic

(     survived  pclass     sex  sibsp  parch      fare   class  embark_town  \
 228         0       2    male      0      0   13.0000  Second  Southampton
 349         0       3    male      0      0    8.6625   Third  Southampton
 602         0       1    male      0      0   42.4000   First  Southampton
 581         1       1  female      1      1  110.8833   First    Cherbourg
 463         0       2    male      0      0   13.0000  Second  Southampton
 ..        ...     ...     ...    ...    ...       ...     ...          ...
 194         1       1  female      0      0   27.7208   First    Cherbourg
 784         0       3    male      0      0    7.0500   Third  Southampton
 551         0       2    male      0      0   26.0000  Second  Southampton
 588         0       3    male      0      0    8.0500   Third  Southampton
 808         0       2    male      0      0   13.0000  Second  Southampton

      alone  survived  alone  sex_male  embark_town_Queenstown  \
 228      1         0      1         1                       0
 349      1         0      1         1                       0
 602      1         0      1         1                       0
 581      0         1      0         0                       0
 463      1         0      1         1                       0
 ..     ...       ...    ...       ...                     ...
 194      1         1      1         0                       0
 784      1         0      1         1                       0
 551      1         0      1         1                       0
 588      1         0      1         1                       0
 808      1         0      1         1                       0

      embark_town_Southampton  class_Second  class_Third
 228                        1             1            0
 349                        1             0            1
 602                        1             0            0
 581                        0             0            0
 463                        1             1            0
 ..                       ...           ...          ...
 194                        0             0            0
 784                        1             0            1
 551                        1             1            0
 588                        1             0            1
 808                        1             1            0

 [623 rows x 16 columns],
      survived  pclass     sex  sibsp  parch      fare   class  embark_town  \
 322         1       2  female      0      0   12.3500  Second   Queenstown
 472         1       2  female      1      2   27.7500  Second  Southampton
 580         1       2  female      1      1   30.0000  Second  Southampton
 104         0       3    male      2      0    7.9250   Third  Southampton
 443         1       2  female      0      0   13.0000  Second  Southampton
 469         1       3  female      2      1   19.2583   Third    Cherbourg
 759         1       1  female      0      0   86.5000   First  Southampton
 845         0       3    male      0      0    7.5500   Third  Southampton
 459         0       3    male      0      0    7.7500   Third   Queenstown
 432         1       2  female      1      0   26.0000  Second  Southampton
 236         0       2    male      1      0   26.0000  Second  Southampton
 4           0       3    male      0      0    8.0500   Third  Southampton
 772         0       2  female      0      0   10.5000  Second  Southampton
 610         0       3  female      1      5   31.2750   Third  Southampton
 29          0       3    male      0      0    7.8958   Third  Southampton
 454         0       3    male      0      0    8.0500   Third  Southampton
 570         1       2    male      0      0   10.5000  Second  Southampton
 511         0       3    male      0      0    8.0500   Third  Southampton
 297         0       1  female      1      2  151.5500   First  Southampton
 725         0       3    male      0      0    8.6625   Third  Southampton
 326         0       3    male      0      0    6.2375   Third  Southampton
 787         0       3    male      4      1   29.1250   Third   Queenstown
 665         0       2    male      2      0   73.5000  Second  Southampton
 667         0       3    male      0      0    7.7750   Third  Southampton
 195         1       1  female      0      0  146.5208   First    Cherbourg
 545         0       1    male      0      0   26.0000   First  Southampton
 474         0       3  female      0      0    9.8375   Third  Southampton
 755         1       2    male      1      1   14.5000  Second  Southampton
 259         1       2  female      0      1   26.0000  Second  Southampton
 846         0       3    male      8      2   69.5500   Third  Southampton
 48          0       3    male      2      0   21.6792   Third    Cherbourg
 435         1       1  female      1      2  120.0000   First  Southampton
 356         1       1  female      0      1   55.0000   First  Southampton
 168         0       1    male      0      0   25.9250   First  Southampton
 39          1       3  female      1      0   11.2417   Third    Cherbourg
 635         1       2  female      0      0   13.0000  Second  Southampton
 51          0       3    male      0      0    7.8000   Third  Southampton
 404         0       3  female      0      0    8.6625   Third  Southampton
 724         1       1    male      1      0   53.1000   First  Southampton
 42          0       3    male      0      0    7.8958   Third    Cherbourg
 796         1       1  female      0      0   25.9292   First  Southampton
 81          1       3    male      0      0    9.5000   Third  Southampton
 60          0       3    male      0      0    7.2292   Third    Cherbourg
 336         0       1    male      1      0   66.6000   First  Southampton
 626         0       2    male      0      0   12.3500  Second   Queenstown
 730         1       1  female      0      0  211.3375   First  Southampton
 744         1       3    male      0      0    7.9250   Third  Southampton
 202         0       3    male      0      0    6.4958   Third  Southampton
 566         0       3    male      0      0    7.8958   Third  Southampton
 361         0       2    male      1      0   27.7208  Second    Cherbourg
 175         0       3    male      1      1    7.8542   Third  Southampton
 242         0       2    male      0      0   10.5000  Second  Southampton
 484         1       1    male      1      0   91.0792   First    Cherbourg
 268         1       1  female      0      1  153.4625   First  Southampton
 877         0       3    male      0      0    7.8958   Third  Southampton
 410         0       3    male      0      0    7.8958   Third  Southampton
 658         0       2    male      0      0   13.0000  Second  Southampton
 840         0       3    male      0      0    7.9250   Third  Southampton
 847         0       3    male      0      0    7.8958   Third    Cherbourg
 214         0       3    male      1      0    7.7500   Third   Queenstown
 239         0       2    male      0      0   12.2750  Second  Southampton
 874         1       2  female      1      0   24.0000  Second    Cherbourg
 607         1       1    male      0      0   30.5000   First  Southampton
 648         0       3    male      0      0    7.5500   Third  Southampton
 498         0       1  female      1      2  151.5500   First  Southampton
 413         0       2    male      0      0    0.0000  Second  Southampton
 3           1       1  female      1      0   53.1000   First  Southampton
 693         0       3    male      0      0    7.2250   Third    Cherbourg
 56          1       2  female      0      0   10.5000  Second  Southampton
 371         0       3    male      1      0    6.4958   Third  Southampton
 533         1       3  female      0      2   22.3583   Third    Cherbourg
 861         0       2    male      1      0   11.5000  Second  Southampton
 487         0       1    male      0      0   29.7000   First    Cherbourg
 889         1       1    male      0      0   30.0000   First    Cherbourg
 726         1       2  female      3      0   21.0000  Second  Southampton
 660         1       1    male      2      0  133.6500   First  Southampton
 494         0       3    male      0      0    8.0500   Third  Southampton
 405         0       2    male      1      0   21.0000  Second  Southampton
 837         0       3    male      0      0    8.0500   Third  Southampton
 793         0       1    male      0      0   30.6958   First    Cherbourg
 680         0       3  female      0      0    8.1375   Third   Queenstown
 714         0       2    male      0      0   13.0000  Second  Southampton
 135         0       2    male      0      0   15.0458  Second    Cherbourg
 591         1       1  female      1      0   78.2667   First    Cherbourg
 684         0       2    male      1      1   39.0000  Second  Southampton
 316         1       2  female      1      0   26.0000  Second  Southampton
 704         0       3    male      1      0    7.8542   Third  Southampton
 442         0       3    male      1      0    7.7750   Third  Southampton
 585         1       1  female      0      2   79.6500   First  Southampton
 203         0       3    male      0      0    7.2250   Third    Cherbourg
 379         0       3    male      0      0    7.7750   Third  Southampton
 864         0       2    male      0      0   13.0000  Second  Southampton
 461         0       3    male      0      0    8.0500   Third  Southampton
 661         0       3    male      0      0    7.2250   Third    Cherbourg
 842         1       1  female      0      0   31.0000   First    Cherbourg
 850         0       3    male      4      2   31.2750   Third  Southampton
 420         0       3    male      0      0    7.8958   Third    Cherbourg
 682         0       3    male      0      0    9.2250   Third  Southampton
 752         0       3    male      0      0    9.5000   Third  Southampton
 338         1       3    male      0      0    8.0500   Third  Southampton
 690         1       1    male      1      0   57.0000   First  Southampton
 705         0       2    male      0      0   26.0000  Second  Southampton
 815         0       1    male      0      0    0.0000   First  Southampton
 251         0       3  female      1      1   10.4625   Third  Southampton
 643         1       3    male      0      0   56.4958   Third  Southampton
 93          0       3    male      1      2   20.5750   Third  Southampton
 604         1       1    male      0      0   26.5500   First    Cherbourg
 63          0       3    male      3      2   27.9000   Third  Southampton
 707         1       1    male      0      0   26.2875   First  Southampton
 838         1       3    male      0      0   56.4958   Third  Southampton
 809         1       1  female      1      0   53.1000   First  Southampton
 872         0       1    male      0      0    5.0000   First  Southampton
 763         1       1  female      1      2  120.0000   First  Southampton
 106         1       3  female      0      0    7.6500   Third  Southampton
 738         0       3    male      0      0    7.8958   Third  Southampton
 12          0       3    male      0      0    8.0500   Third  Southampton
 298         1       1    male      0      0   30.5000   First  Southampton
 762         1       3    male      0      0    7.2292   Third    Cherbourg
 444         1       3    male      0      0    8.1125   Third  Southampton
 288         1       2    male      0      0   13.0000  Second  Southampton
 216         1       3  female      0      0    7.9250   Third  Southampton
 717         1       2  female      0      0   10.5000  Second  Southampton
 337         1       1  female      0      0  134.5000   First    Cherbourg
 393         1       1  female      1      0  113.2750   First    Cherbourg
 501         0       3  female      0      0    7.7500   Third   Queenstown
 512         1       1    male      0      0   26.2875   First  Southampton
 311         1       1  female      2      2  262.3750   First    Cherbourg
 164         0       3    male      4      1   39.6875   Third  Southampton
 698         0       1    male      1      1  110.8833   First    Cherbourg
 240         0       3  female      1      0   14.4542   Third    Cherbourg
 419         0       3  female      0      2   24.1500   Third  Southampton
 250         0       3    male      0      0    7.2500   Third  Southampton
 516         1       2  female      0      0   10.5000  Second  Southampton
 166         1       1  female      0      1   55.0000   First  Southampton

      alone  survived  alone  sex_male  embark_town_Queenstown  \
 322      1         1      1         0                       1
 472      0         1      0         0                       0
 580      0         1      0         0                       0
 104      0         0      0         1                       0
 443      1         1      1         0                       0
 469      0         1      0         0                       0
 759      1         1      1         0                       0
 845      1         0      1         1                       0
 459      1         0      1         1                       1
 432      0         1      0         0                       0
 236      0         0      0         1                       0
 4        1         0      1         1                       0
 772      1         0      1         0                       0
 610      0         0      0         0                       0
 29       1         0      1         1                       0
 454      1         0      1         1                       0
 570      1         1      1         1                       0
 511      1         0      1         1                       0
 297      0         0      0         0                       0
 725      1         0      1         1                       0
 326      1         0      1         1                       0
 787      0         0      0         1                       1
 665      0         0      0         1                       0
 667      1         0      1         1                       0
 195      1         1      1         0                       0
 545      1         0      1         1                       0
 474      1         0      1         0                       0
 755      0         1      0         1                       0
 259      0         1      0         0                       0
 846      0         0      0         1                       0
 48       0         0      0         1                       0
 435      0         1      0         0                       0
 356      0         1      0         0                       0
 168      1         0      1         1                       0
 39       0         1      0         0                       0
 635      1         1      1         0                       0
 51       1         0      1         1                       0
 404      1         0      1         0                       0
 724      0         1      0         1                       0
 42       1         0      1         1                       0
 796      1         1      1         0                       0
 81       1         1      1         1                       0
 60       1         0      1         1                       0
 336      0         0      0         1                       0
 626      1         0      1         1                       1
 730      1         1      1         0                       0
 744      1         1      1         1                       0
 202      1         0      1         1                       0
 566      1         0      1         1                       0
 361      0         0      0         1                       0
 175      0         0      0         1                       0
 242      1         0      1         1                       0
 484      0         1      0         1                       0
 268      0         1      0         0                       0
 877      1         0      1         1                       0
 410      1         0      1         1                       0
 658      1         0      1         1                       0
 840      1         0      1         1                       0
 847      1         0      1         1                       0
 214      0         0      0         1                       1
 239      1         0      1         1                       0
 874      0         1      0         0                       0
 607      1         1      1         1                       0
 648      1         0      1         1                       0
 498      0         0      0         0                       0
 413      1         0      1         1                       0
 3        0         1      0         0                       0
 693      1         0      1         1                       0
 56       1         1      1         0                       0
 371      0         0      0         1                       0
 533      0         1      0         0                       0
 861      0         0      0         1                       0
 487      1         0      1         1                       0
 889      1         1      1         1                       0
 726      0         1      0         0                       0
 660      0         1      0         1                       0
 494      1         0      1         1                       0
 405      0         0      0         1                       0
 837      1         0      1         1                       0
 793      1         0      1         1                       0
 680      1         0      1         0                       1
 714      1         0      1         1                       0
 135      1         0      1         1                       0
 591      0         1      0         0                       0
 684      0         0      0         1                       0
 316      0         1      0         0                       0
 704      0         0      0         1                       0
 442      0         0      0         1                       0
 585      0         1      0         0                       0
 203      1         0      1         1                       0
 379      1         0      1         1                       0
 864      1         0      1         1                       0
 461      1         0      1         1                       0
 661      1         0      1         1                       0
 842      1         1      1         0                       0
 850      0         0      0         1                       0
 420      1         0      1         1                       0
 682      1         0      1         1                       0
 752      1         0      1         1                       0
 338      1         1      1         1                       0
 690      0         1      0         1                       0
 705      1         0      1         1                       0
 815      1         0      1         1                       0
 251      0         0      0         0                       0
 643      1         1      1         1                       0
 93       0         0      0         1                       0
 604      1         1      1         1                       0
 63       0         0      0         1                       0
 707      1         1      1         1                       0
 838      1         1      1         1                       0
 809      0         1      0         0                       0
 872      1         0      1         1                       0
 763      0         1      0         0                       0
 106      1         1      1         0                       0
 738      1         0      1         1                       0

In [81]:
## IRIS DATA

seed = 27

train_iris, val_test = train_test_split(tidied_iris, train_size = 0.7, random_state = seed, stratify = tidied_iris['species'])

# TRAIN

In [82]:
## IRIS DATA

validate_iris, test_iris = train_test_split(val_test, train_size = 0.5, random_state = seed, stratify = val_test['species'])

In [83]:
## IRIS DATA

train_iris.shape, validate_iris.shape, test_iris.shape

((105, 8), (22, 8), (23, 8))

In [84]:
## IRIS DATA

test_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23 entries, 140 to 47
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   species             23 non-null     object
 1   sepal_length        23 non-null     float64
 2   sepal_width         23 non-null     float64
 3   petal_length        23 non-null     float64
 4   petal_width         23 non-null     float64
 5   species_setosa      23 non-null     uint8
 6   species_versicolor  23 non-null     uint8
 7   species_virginica   23 non-null     uint8
dtypes: float64(4), object(1), uint8(3)
memory usage: 1.1+ KB

In [201]:
def iris_training_validate_testing(df, target = ''):
    
    seed = 27
    
    train_iris, val_test = train_test_split(df, 
                                            train_size = 0.7, 
                                            random_state = seed, 
                                            stratify = df[target])

    validate_iris, test_iris = train_test_split(df, 
                                                train_size = 0.5, 
                                                random_state = seed,
                                                stratify = df[target])

    return train_iris, validate_iris, test_iris

In [202]:
## Run the function in your notebook on the Iris dataset, 
## returning 3 datasets, train_iris, validate_iris and test_iris. 

train_iris, validate_iris, test_iris

(        species  sepal_length  sepal_width  petal_length  petal_width  \
 48       setosa           5.3          3.7           1.5          0.2
 5        setosa           5.4          3.9           1.7          0.4
 141   virginica           6.9          3.1           5.1          2.3
 115   virginica           6.4          3.2           5.3          2.3
 23       setosa           5.1          3.3           1.7          0.5
 11       setosa           4.8          3.4           1.6          0.2
 116   virginica           6.5          3.0           5.5          1.8
 109   virginica           7.2          3.6           6.1          2.5
 9        setosa           4.9          3.1           1.5          0.1
 6        setosa           4.6          3.4           1.4          0.3
 99   versicolor           5.7          2.8           4.1          1.3
 40       setosa           5.0          3.5           1.3          0.3
 112   virginica           6.8          3.0           5.5          2.1
 89   versicolor           5.5          2.5           4.0          1.3
 41       setosa           4.5          2.3           1.3          0.3
 28       setosa           5.2          3.4           1.4          0.2
 43       setosa           5.0          3.5           1.6          0.6
 147   virginica           6.5          3.0           5.2          2.0
 29       setosa           4.7          3.2           1.6          0.2
 96   versicolor           5.7          2.9           4.2          1.3
 110   virginica           6.5          3.2           5.1          2.0
 63   versicolor           6.1          2.9           4.7          1.4
 80   versicolor           5.5          2.4           3.8          1.1
 46       setosa           5.1          3.8           1.6          0.2
 86   versicolor           6.7          3.1           4.7          1.5
 132   virginica           6.4          2.8           5.6          2.2
 60   versicolor           5.0          2.0           3.5          1.0
 88   versicolor           5.6          3.0           4.1          1.3
 7        setosa           5.0          3.4           1.5          0.2
 56   versicolor           6.3          3.3           4.7          1.6
 70   versicolor           5.9          3.2           4.8          1.8
 118   virginica           7.7          2.6           6.9          2.3
 27       setosa           5.2          3.5           1.5          0.2
 30       setosa           4.8          3.1           1.6          0.2
 130   virginica           7.4          2.8           6.1          1.9
 146   virginica           6.3          2.5           5.0          1.9
 1        setosa           4.9          3.0           1.4          0.2
 79   versicolor           5.7          2.6           3.5          1.0
 77   versicolor           6.7          3.0           5.0          1.7
 58   versicolor           6.6          2.9           4.6          1.3
 39       setosa           5.1          3.4           1.5          0.2
 12       setosa           4.8          3.0           1.4          0.1
 38       setosa           4.4          3.0           1.3          0.2
 73   versicolor           6.1          2.8           4.7          1.2
 52   versicolor           6.9          3.1           4.9          1.5
 137   virginica           6.4          3.1           5.5          1.8
 125   virginica           7.2          3.2           6.0          1.8
 0        setosa           5.1          3.5           1.4          0.2
 145   virginica           6.7          3.0           5.2          2.3
 93   versicolor           5.0          2.3           3.3          1.0
 16       setosa           5.4          3.9           1.3          0.4
 71   versicolor           6.1          2.8           4.0          1.3
 72   versicolor           6.3          2.5           4.9          1.5
 139   virginica           6.9          3.1           5.4          2.1
 26       setosa           5.0          3.4           1.6          0.4
 32       setosa           5.2          4.1           1.5          0.1
 136   virginica           6.3          3.4           5.6          2.4
 97   versicolor           6.2          2.9           4.3          1.3
 34       setosa           4.9          3.1           1.5          0.2
 45       setosa           4.8          3.0           1.4          0.3
 114   virginica           5.8          2.8           5.1          2.4
 95   versicolor           5.7          3.0           4.2          1.2
 44       setosa           5.1          3.8           1.9          0.4
 148   virginica           6.2          3.4           5.4          2.3
 68   versicolor           6.2          2.2           4.5          1.5
 20       setosa           5.4          3.4           1.7          0.2
 138   virginica           6.0          3.0           4.8          1.8
 67   versicolor           5.8          2.7           4.1          1.0
 135   virginica           7.7          3.0           6.1          2.3
 92   versicolor           5.8          2.6           4.0          1.2
 42       setosa           4.4          3.2           1.3          0.2
 129   virginica           7.2          3.0           5.8          1.6
 55   versicolor           5.7          2.8           4.5          1.3
 14       setosa           5.8          4.0           1.2          0.2
 74   versicolor           6.4          2.9           4.3          1.3
 21       setosa           5.1          3.7           1.5          0.4
 69   versicolor           5.6          2.5           3.9          1.1
 35       setosa           5.0          3.2           1.2          0.2
 113   virginica           5.7          2.5           5.0          2.0
 111   virginica           6.4          2.7           5.3          1.9
 82   versicolor           5.8          2.7           3.9          1.2
 91   versicolor           6.1          3.0           4.6          1.4
 87   versicolor           6.3          2.3           4.4          1.3
 98   versicolor           5.1          2.5           3.0          1.1
 83   versicolor           6.0          2.7           5.1          1.6
 103   virginica           6.3          2.9           5.6          1.8
 62   versicolor           6.0          2.2           4.0          1.0
 17       setosa           5.1          3.5           1.4          0.3
 107   virginica           7.3          2.9           6.3          1.8
 59   versicolor           5.2          2.7           3.9          1.4
 94   versicolor           5.6          2.7           4.2          1.3
 120   virginica           6.9          3.2           5.7          2.3
 18       setosa           5.7          3.8           1.7          0.3
 108   virginica           6.7          2.5           5.8          1.8
 142   virginica           5.8          2.7           5.1          1.9
 3        setosa           4.6          3.1           1.5          0.2
 22       setosa           4.6          3.6           1.0          0.2
 85   versicolor           6.0          3.4           4.5          1.6
 121   virginica           5.6          2.8           4.9          2.0
 105   virginica           7.6          3.0           6.6          2.1
 101   virginica           5.8          2.7           5.1          1.9
 133   virginica           6.3          2.8           5.1          1.5
 131   virginica           7.9          3.8           6.4          2.0
 127   virginica           6.1          3.0           4.9          1.8
 143   virginica           6.8          3.2           5.9          2.3

      species_setosa  species_versicolor  species_virginica
 48                1                   0                  0
 5                 1                   0                  0
 141               0                   0                  1
 115               0                   0                  1
 23                1                   0                  0
 11                1                   0                  0
 116               0                   0                  1
 109               0                   0                  1
 9                 1                   0                  0
 6                 1                   0                  0
 99                0                   1                  0
 40                1                   0                  0
 112               0                   0                  1
 89                0                   1                  0
 41                1                   0                  0
 28                1                   0                  0
 43                1                   0                  0
 147               0                   0                  1
 29                1                   0                  0
 96                0                   1                  0
 110               0                   0                  1
 63                0                   1                  0
 80                0                   1                  0
 46                1                   0                  0
 86                0                   1                  0
 132               0                   0                  1
 60                0                   1                  0
 88                0                   1                  0
 7                 1                   0                  0
 56                0                   1                  0
 70                0                   1                  0
 118               0                   0                  1
 27                1                   0                  0
 30                1                   0                  0
 130               0                   0                  1
 146               0                   0                  1
 1                 1                   0                  0
 79                0                   1                  0
 77                0                   1                  0
 58                0                   1                  0
 39                1                   0                  0
 12                1                   0                  0
 38                1                   0                  0
 73                0                   1                  0
 52                0                   1                  0
 137               0                   0                  1
 125               0                   0                  1
 0                 1                   0                  0
 145               0                   0                  1
 93                0                   1                  0
 16                1                   0                  0
 71                0                   1                  0
 72                0                   1                  0
 139               0                   0                  1
 26                1                   0                  0
 32                1                   0                  0
 136               0                   0                  1
 97                0                   1                  0
 34                1                   0                  0
 45                1                   0                  0
 114               0                   0                  1
 95                0                   1                  0
 44                1                   0                  0
 148               0                   0                  1
 68                0                   1                  0
 20                1                   0                  0
 138               0                   0                  1
 67                0                   1                  0
 135               0                   0                  1
 92                0                   1                  0
 42                1                   0                  0
 129               0                   0                  1
 55                0                   1                  0
 14                1                   0                  0
 74                0                   1                  0
 21                1                   0                  0
 69                0                   1                  0
 35                1                   0                  0
 113               0                   0                  1
 111               0                   0                  1
 82                0                   1                  0
 91                0                   1                  0
 87                0                   1                  0
 98                0                   1                  0
 83                0                   1                  0
 103               0                   0                  1
 62                0                   1                  0
 17                1                   0                  0
 107               0                   0                  1
 59                0                   1                  0
 94                0                   1                  0
 120               0                   0                  1
 18                1                   0                  0
 108               0                   0                  1
 142               0                   0                  1
 3                 1                   0                  0
 22                1                   0                  0
 85                0                   1                  0
 121               0                   0                  1
 105               0                   0                  1
 101               0                   0                  1
 133               0                   0                  1
 131               0                   0                  1
 127               0                   0                  1
 143               0                   0                  1  ,
         species  sepal_length  sepal_width  petal_length  petal_width  \
 84   versicolor           5.4          3.0           4.5          1.5
 149   virginica           5.9          3.0           5.1          1.8
 31       setosa           5.4          3.4           1.5          0.4
 81   versicolor           5.5          2.4           3.7          1.0
 15       setosa           5.7          4.4           1.5          0.4
 2        setosa           4.7          3.2           1.3          0.2
 8        setosa           4.4          2.9           1.4          0.2
 33       setosa           5.5          4.2           1.4          0.2
 64   versicolor           5.6          2.9           3.6          1.3
 122   virginica           7.7          2.8           6.7          2.0
 78   versicolor           6.0          2.9           4.5          1.5
 117   virginica           7.7          3.8           6.7          2.2
 65   versicolor           6.7          3.1           4.4          1.4
 49       setosa           5.0          3.3           1.4          0.2
 53   versicolor           5.5          2.3           4.0          1.3
 50   versicolor           7.0          3.2           4.7          1.4
 76   versicolor           6.8          2.8           4.8          1.4
 134   virginica           6.1          2.6           5.6          1.4
 119   virginica           6.0          2.2           5.0          1.5
 123   virginica           6.3          2.7           4.9          1.8
 37       setosa           4.9          3.6           1.4          0.1
 124   virginica           6.7          3.3           5.7          2.1

      species_setosa  species_versicolor  species_virginica
 84                0                   1                  0
 149               0                   0                  1
 31                1                   0                  0
 81                0                   1                  0
 15                1                   0                  0
 2                 1                   0                  0
 8                 1                   0                  0
 33                1                   0                  0
 64                0                   1                  0
 122               0                   0                  1
 78                0                   1                  0
 117               0                   0                  1
 65                0                   1                  0
 49                1                   0                  0
 53                0                   1                  0
 50                0                   1                  0
 76                0                   1                  0
 134               0                   0                  1
 119               0                   0                  1
 123               0                   0                  1
 37                1                   0                  0
 124               0                   0                  1  ,
         species  sepal_length  sepal_width  petal_length  petal_width  \
 140   virginica           6.7          3.1           5.6          2.4
 51   versicolor           6.4          3.2           4.5          1.5
 75   versicolor           6.6          3.0           4.4          1.4
 10       setosa           5.4          3.7           1.5          0.2
 57   versicolor           4.9          2.4           3.3          1.0
 54   versicolor           6.5          2.8           4.6          1.5
 25       setosa           5.0          3.0           1.6          0.2
 106   virginica           4.9          2.5           4.5          1.7
 24       setosa           4.8          3.4           1.9          0.2
 100   virginica           6.3          3.3           6.0          2.5
 19       setosa           5.1          3.8           1.5          0.3
 13       setosa           4.3          3.0           1.1          0.1
 4        setosa           5.0          3.6           1.4          0.2
 102   virginica           7.1          3.0           5.9          2.1
 104   virginica           6.5          3.0           5.8          2.2
 90   versicolor           5.5          2.6           4.4          1.2
 126   virginica           6.2          2.8           4.8          1.8
 36       setosa           5.5          3.5           1.3          0.2
 66   versicolor           5.6          3.0           4.5          1.5
 144   virginica           6.7          3.3           5.7          2.5
 61   versicolor           5.9          3.0           4.2          1.5
 128   virginica           6.4          2.8           5.6          2.1
 47       setosa           4.6          3.2           1.4          0.2

      species_setosa  species_versicolor  species_virginica
 140               0                   0                  1
 51                0                   1                  0
 75                0                   1                  0
 10                1                   0                  0
 57                0                   1                  0
 54                0                   1                  0
 25                1                   0                  0
 106               0                   0                  1
 24                1                   0                  0
 100               0                   0                  1
 19                1                   0                  0
 13                1                   0                  0
 4                 1                   0                  0
 102               0                   0                  1
 104               0                   0                  1
 90                0                   1                  0
 126               0                   0                  1
 36                1                   0                  0
 66                0                   1                  0
 144               0                   0                  1
 61                0                   1                  0

In [100]:
## TELCO DATA

seed = 27

train_telco, val_test = train_test_split(tidied_telco, train_size = 0.7, random_state = seed, stratify = tidied_telco['dependents'])

In [101]:
## TELCO DATA

validate_telco, test_telco = train_test_split(val_test, train_size = 0.5, random_state = seed, stratify = val_test['dependents'])

In [196]:
## TELCO DATA

def telco_training_validate_testing(df, target = ''):
    
    seed = 27  
    
    train_telco, val_telco = train_test_split(tidied_telco, 
                                              train_size = 0.7, 
                                              random_state = seed, 
                                              stratify = tidied_telco[target])

    validate_telco, test_telco = train_test_split(val_test, 
                                                  train_size = 0.5, 
                                                  random_state = seed, 
                                                  stratify = val_test[target])
    
    return train_telco, validate_telco, test_telco

In [197]:
## TELCO DATA

train_telco.shape, validate_telco.shape, test_telco.shape

((4930, 32), (1056, 32), (1057, 32))

In [198]:
## Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.

train_telco, validate_telco, test_telco

(      payment_type_id  internet_service_type_id  contract_type_id customer_id  \
 4214                1                         1                 1  5949-HGVJL
 3110                2                         3                 3  4458-KVRBJ
 3226                3                         3                 3  4625-XMOYM
 921                 4                         1                 2  1337-BOZWO
 3768                4                         1                 2  5306-BVTKJ
 ...               ...                       ...               ...         ...
 504                 2                         1                 1  0734-OXWBT
 3074                2                         3                 1  4397-FRLTA
 3409                4                         3                 1  4830-FAXFM
 417                 3                         2                 1  0618-XWMSS
 1712                1                         2                 1  2495-KZNFB

       gender  senior_citizen partner dependents  tenure phone_service  ...  \
 4214  Female               0     Yes         No      26           Yes  ...
 3110    Male               0      No         No      59           Yes  ...
 3226  Female               0     Yes        Yes      72           Yes  ...
 921     Male               0     Yes        Yes      18            No  ...
 3768    Male               0     Yes        Yes      48           Yes  ...
 ...      ...             ...     ...        ...     ...           ...  ...
 504     Male               0      No        Yes       3           Yes  ...
 3074  Female               0      No         No       4           Yes  ...
 3409    Male               0      No        Yes      19           Yes  ...
 417     Male               0      No        Yes      28           Yes  ...
 1712  Female               0      No         No      33           Yes  ...

      internet_service_type               payment_type gender_Female  \
 4214                   DSL           Electronic check             1
 3110                  None               Mailed check             0
 3226                  None  Bank transfer (automatic)             1
 921                    DSL    Credit card (automatic)             0
 3768                   DSL    Credit card (automatic)             0
 ...                    ...                        ...           ...
 504                    DSL               Mailed check             0
 3074                  None               Mailed check             1
 3409                  None    Credit card (automatic)             0
 417            Fiber optic  Bank transfer (automatic)             0
 1712           Fiber optic           Electronic check             1

      gender_Male partner_No partner_Yes dependents_No dependents_Yes  \
 4214           0          0           1             1              0
 3110           1          1           0             1              0
 3226           0          0           1             0              1
 921            1          0           1             0              1
 3768           1          0           1             0              1
 ...          ...        ...         ...           ...            ...
 504            1          1           0             0              1
 3074           0          1           0             1              0
 3409           1          1           0             0              1
 417            1          1           0             0              1
 1712           0          1           0             1              0

       paperless_billing_No paperless_billing_Yes
 4214                     0                     1
 3110                     1                     0
 3226                     0                     1
 921                      1                     0
 3768                     0                     1
 ...                    ...                   ...
 504                      1                     0
 3074                     1                     0
 3409                     0                     1
 417                      0                     1
 1712                     0                     1

 [4930 rows x 32 columns],
       payment_type_id  internet_service_type_id  contract_type_id customer_id  \
 3812                3                         1                 3  5360-XGYAZ
 3125                1                         1                 1  4482-FTFFX
 5512                4                         2                 3  7762-URZQH
 1900                1                         2                 1  2761-OCIAX
 5549                3                         3                 1  7814-LEEVE
 ...               ...                       ...               ...         ...
 1880                1                         2                 1  2725-KXXWT
 2439                1                         2                 1  3494-JCHRQ
 4505                2                         1                 1  6351-SCJKT
 2908                4                         1                 1  4139-JPIAM
 4433                1                         2                 2  6250-CGGUN

       gender  senior_citizen partner dependents  tenure phone_service  ...  \
 3812    Male               0     Yes        Yes      72            No  ...
 3125    Male               0      No         No       5           Yes  ...
 5512    Male               0     Yes         No      66           Yes  ...
 1900    Male               1      No         No       2           Yes  ...
 5549  Female               0     Yes         No       1           Yes  ...
 ...      ...             ...     ...        ...     ...           ...  ...
 1880    Male               0     Yes         No       1           Yes  ...
 2439    Male               0      No         No       1           Yes  ...
 4505    Male               0      No         No       3            No  ...
 2908    Male               0      No         No      51            No  ...
 4433    Male               0      No         No      54           Yes  ...

      internet_service_type               payment_type gender_Female  \
 3812                   DSL  Bank transfer (automatic)             0
 3125                   DSL           Electronic check             0
 5512           Fiber optic    Credit card (automatic)             0
 1900           Fiber optic           Electronic check             0
 5549                  None  Bank transfer (automatic)             1
 ...                    ...                        ...           ...
 1880           Fiber optic           Electronic check             0
 2439           Fiber optic           Electronic check             0
 4505                   DSL               Mailed check             0
 2908                   DSL    Credit card (automatic)             0
 4433           Fiber optic           Electronic check             0

      gender_Male partner_No partner_Yes dependents_No dependents_Yes  \
 3812           1          0           1             0              1
 3125           1          1           0             1              0
 5512           1          0           1             1              0
 1900           1          1           0             1              0
 5549           0          0           1             1              0
 ...          ...        ...         ...           ...            ...
 1880           1          0           1             1              0
 2439           1          1           0             1              0
 4505           1          1           0             1              0
 2908           1          1           0             1              0
 4433           1          1           0             1              0

       paperless_billing_No paperless_billing_Yes
 3812                     0                     1
 3125                     1                     0
 5512                     0                     1
 1900                     0                     1
 5549                     0                     1
 ...                    ...                   ...
 1880                     0                     1
 2439                     0                     1
 4505                     1                     0
 2908                     0                     1
 4433                     1                     0

 [1056 rows x 32 columns],
       payment_type_id  internet_service_type_id  contract_type_id customer_id  \
 5024                3                         3                 2  7061-OVMIM
 5359                2                         1                 1  7568-PODML
 5057                1                         1                 1  7109-MFBYV
 1289                1                         1                 1  1919-RTPQD
 5153                3                         1                 2  7247-XOZPB
 ...               ...                       ...               ...         ...
 4232                4                         3                 3  5970-GHJAW
 4600                4                         1                 1  6483-OATDN
 6802                3                         2                 2  9651-GTSAQ
 3797                1                         2                 1  5339-PXDVH
 6060                4                         1                 3  8590-YFFQO

       gender  senior_citizen partner dependents  tenure phone_service  ...  \
 5024  Female               0     Yes        Yes      30           Yes  ...
 5359    Male               0      No         No       1            No  ...
 5057    Male               0      No         No      26           Yes  ...
 1289    Male               0     Yes        Yes       7           Yes  ...
 5153    Male               0     Yes         No      53           Yes  ...
 ...      ...             ...     ...        ...     ...           ...  ...
 4232    Male               0     Yes        Yes      46           Yes  ...
 4600    Male               0     Yes        Yes       8           Yes  ...
 6802  Female               0     Yes         No      53           Yes  ...
 3797    Male               0      No         No       4           Yes  ...
 6060    Male               0     Yes         No      70           Yes  ...

      internet_service_type               payment_type gender_Female  \
 5024                  None  Bank transfer (automatic)             1
 5359                   DSL               Mailed check             0
 5057                   DSL           Electronic check             0
 1289                   DSL           Electronic check             0
 5153                   DSL  Bank transfer (automatic)             0
 ...                    ...                        ...           ...
 4232                  None    Credit card (automatic)             0
 4600                   DSL    Credit card (automatic)             0
 6802           Fiber optic  Bank transfer (automatic)             1
 3797           Fiber optic           Electronic check             0
 6060                   DSL    Credit card (automatic)             0

      gender_Male partner_No partner_Yes dependents_No dependents_Yes  \
 5024           0          0           1             0              1
 5359           1          1           0             1              0
 5057           1          1           0             1              0
 1289           1          0           1             0              1
 5153           1          0           1             1              0
 ...          ...        ...         ...           ...            ...
 4232           1          0           1             0              1
 4600           1          0           1             0              1
 6802           0          0           1             1              0
 3797           1          1           0             1              0
 6060           1          0           1             1              0

       paperless_billing_No paperless_billing_Yes
 5024                     1                     0
 5359                     0                     1
 5057                     1                     0
 1289                     1                     0
 5153                     1                     0
 ...                    ...                   ...
 4232                     1                     0
 4600                     0                     1
 6802                     0                     1
 3797                     1                     0
 6060                     1                     0

 [1057 rows x 32 columns])

In [205]:
train_telco, validate_telco, test_telco = split_data( telco_data, target = 'churn')

NameError: name 'split_data' is not defined